buserror/simavr/simavr/cores/sim_atmega2560.c
/*
   sim_mega2560.c

   Copyright 2008, 2009 Michel Pollet <buserror@gmail.com>
   Copyright 2013 Yann GOUY <yann_gouy@yahoo.fr>

   This file is part of simavr.

   simavr is free software: you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation, either version 3 of the License, or
   (at your option) any later version.

   simavr is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with simavr.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "sim_avr.h"
#include "sim_core_declare.h"
#include "avr_eeprom.h"
#include "avr_flash.h"
#include "avr_watchdog.h"
#include "avr_extint.h"
#include "avr_ioport.h"
#include "avr_uart.h"
#include "avr_adc.h"
#include "avr_timer.h"
#include "avr_spi.h"
#include "avr_twi.h"

void m2560_init(struct avr_t * avr);
void m2560_reset(struct avr_t * avr);

#define _AVR_IO_H_
#define __ASSEMBLER__
#ifndef __AVR_ATmega2560__
#define __AVR_ATmega2560__
#endif
#include "avr/iom2560.h"

/*
 * This is a template for all of the 2560 devices, hopefully
 */
const struct mcu_t {
	avr_t			core;
	avr_eeprom_t	eeprom;
	avr_flash_t		selfprog;
	avr_watchdog_t	watchdog;
	avr_extint_t	extint;
	avr_ioport_t	porta, portb, portc, portd, porte, portf, portg, porth, portj, portk, portl;
	avr_uart_t		uart0,uart1;
	avr_uart_t		uart2,uart3;
	avr_adc_t		adc;
	avr_timer_t		timer0,timer1,timer2,timer3,timer4,timer5;
	avr_spi_t		spi;
	avr_twi_t		twi;
 } mcu_mega2560 = {
	.core = {
		.mmcu = "atmega2560",
		DEFAULT_CORE(4),

		.init = m2560_init,
		.reset = m2560_reset,

		.rampz = RAMPZ, // extended program memory access
	},
	AVR_EEPROM_DECLARE(EE_READY_vect),
	AVR_SELFPROG_DECLARE(SPMCSR, SPMEN, SPM_READY_vect),
	AVR_WATCHDOG_DECLARE(WDTCSR, WDT_vect),
	.extint = {
		AVR_EXTINT_MEGA_DECLARE(0, 'D', PD0, A),
		AVR_EXTINT_MEGA_DECLARE(1, 'D', PD1, A),
		AVR_EXTINT_MEGA_DECLARE(2, 'D', PD2, A),
		AVR_EXTINT_MEGA_DECLARE(3, 'D', PD3, A),
		AVR_EXTINT_MEGA_DECLARE(4, 'E', PE4, B),
		AVR_EXTINT_MEGA_DECLARE(5, 'E', PE5, B),
		AVR_EXTINT_MEGA_DECLARE(6, 'E', PE6, B),
		AVR_EXTINT_MEGA_DECLARE(7, 'E', PE7, B),
	},
	.porta = {
		.name = 'A', .r_port = PORTA, .r_ddr = DDRA, .r_pin = PINA,
	},
	.portb = {
		.name = 'B', .r_port = PORTB, .r_ddr = DDRB, .r_pin = PINB,
		.pcint = {
			 .enable = AVR_IO_REGBIT(PCICR, PCIE0),
			 .raised = AVR_IO_REGBIT(PCIFR, PCIF0),
			 .vector = PCINT0_vect,
		},
		.r_pcint = PCMSK0,
	},
	.portc = {
		.name = 'C', .r_port = PORTC, .r_ddr = DDRC, .r_pin = PINC,
	},
	.portd = {
		.name = 'D', .r_port = PORTD, .r_ddr = DDRD, .r_pin = PIND,
	},
	.porte = {
		.name = 'E', .r_port = PORTE, .r_ddr = DDRE, .r_pin = PINE,
	},
	.portf = {
		.name = 'F', .r_port = PORTF, .r_ddr = DDRF, .r_pin = PINF,
	},
	.portg = {
		.name = 'G', .r_port = PORTG, .r_ddr = DDRG, .r_pin = PING,
	},

	.porth = {
		.name = 'H', .r_port = PORTH, .r_ddr = DDRH, .r_pin = PINH,
	},
	.portj = {
		.name = 'J', .r_port = PORTJ, .r_ddr = DDRJ, .r_pin = PINJ,
	},
	.portk = {
		.name = 'K', .r_port = PORTK, .r_ddr = DDRK, .r_pin = PINK,
	},
	.portl = {
		.name = 'L', .r_port = PORTL, .r_ddr = DDRL, .r_pin = PINL,
	},

	.uart0 = {
		.disabled = AVR_IO_REGBIT(PRR0,PRUSART0),
		.name = '0',
		.r_udr = UDR0,

		.txen = AVR_IO_REGBIT(UCSR0B, TXEN0),
		.rxen = AVR_IO_REGBIT(UCSR0B, RXEN0),
		.ucsz = AVR_IO_REGBITS(UCSR0C, UCSZ00, 0x3), // 2 bits
		.ucsz2 = AVR_IO_REGBIT(UCSR0B, UCSZ02),		// 1 bits

		.r_ucsra = UCSR0A,
		.r_ucsrb = UCSR0B,
		.r_ucsrc = UCSR0C,
		.r_ubrrl = UBRR0L,
		.r_ubrrh = UBRR0H,
		.rxc = {
			 .enable = AVR_IO_REGBIT(UCSR0B, RXCIE0),
			 .raised = AVR_IO_REGBIT(UCSR0A, RXC0),
			 .vector = USART0_RX_vect,
		},
		.txc = {
			 .enable = AVR_IO_REGBIT(UCSR0B, TXCIE0),
			 .raised = AVR_IO_REGBIT(UCSR0A, TXC0),
			 .vector = USART0_TX_vect,
		},
		.udrc = {
			 .enable = AVR_IO_REGBIT(UCSR0B, UDRIE0),
			 .raised = AVR_IO_REGBIT(UCSR0A, UDRE0),
			 .vector = USART0_UDRE_vect,
		},
	},
	.uart1 = {
		.disabled = AVR_IO_REGBIT(PRR1,PRUSART1),
		.name = '1',
		.r_udr = UDR1,

		.txen = AVR_IO_REGBIT(UCSR1B, TXEN1),
		.rxen = AVR_IO_REGBIT(UCSR1B, RXEN1),
		.ucsz = AVR_IO_REGBITS(UCSR1C, UCSZ10, 0x3), // 2 bits
		.ucsz2 = AVR_IO_REGBIT(UCSR1B, UCSZ12),		// 1 bits

		.r_ucsra = UCSR1A,
		.r_ucsrb = UCSR1B,
		.r_ucsrc = UCSR1C,
		.r_ubrrl = UBRR1L,
		.r_ubrrh = UBRR1H,
		.rxc = {
			 .enable = AVR_IO_REGBIT(UCSR1B, RXCIE1),
			 .raised = AVR_IO_REGBIT(UCSR1A, RXC1),
			 .vector = USART1_RX_vect,
		},
		.txc = {
			 .enable = AVR_IO_REGBIT(UCSR1B, TXCIE1),
			 .raised = AVR_IO_REGBIT(UCSR1A, TXC1),
			 .vector = USART1_TX_vect,
		},
		.udrc = {
			 .enable = AVR_IO_REGBIT(UCSR1B, UDRIE1),
			 .raised = AVR_IO_REGBIT(UCSR1A, UDRE1),
			 .vector = USART1_UDRE_vect,
		},
	},

	.uart2 = {
		.disabled = AVR_IO_REGBIT(PRR1,PRUSART2),
		.name = '2',
		.r_udr = UDR2,

		.txen = AVR_IO_REGBIT(UCSR2B, TXEN2),
		.rxen = AVR_IO_REGBIT(UCSR2B, RXEN2),
		.ucsz = AVR_IO_REGBITS(UCSR2C, UCSZ20, 0x3), // 2 bits
		.ucsz2 = AVR_IO_REGBIT(UCSR2B, UCSZ22),		// 1 bits

		.r_ucsra = UCSR2A,
		.r_ucsrb = UCSR2B,
		.r_ucsrc = UCSR2C,
		.r_ubrrl = UBRR2L,
		.r_ubrrh = UBRR2H,
		.rxc = {
			 .enable = AVR_IO_REGBIT(UCSR2B, RXCIE2),
			 .raised = AVR_IO_REGBIT(UCSR2A, RXC2),
			 .vector = USART2_RX_vect,
		},
		.txc = {
			 .enable = AVR_IO_REGBIT(UCSR2B, TXCIE2),
			 .raised = AVR_IO_REGBIT(UCSR2A, TXC2),
			 .vector = USART2_TX_vect,
		},
		.udrc = {
			 .enable = AVR_IO_REGBIT(UCSR2B, UDRIE2),
			 .raised = AVR_IO_REGBIT(UCSR2A, UDRE2),
			 .vector = USART2_UDRE_vect,
		},
	},

	.uart3 = {
		.disabled = AVR_IO_REGBIT(PRR1,PRUSART3),
		.name = '3',
		.r_udr = UDR3,

		.txen = AVR_IO_REGBIT(UCSR3B, TXEN3),
		.rxen = AVR_IO_REGBIT(UCSR3B, RXEN3),
		.ucsz = AVR_IO_REGBITS(UCSR3C, UCSZ30, 0x3), // 2 bits
		.ucsz2 = AVR_IO_REGBIT(UCSR3B, UCSZ32),		// 1 bits

		.r_ucsra = UCSR3A,
		.r_ucsrb = UCSR3B,
		.r_ucsrc = UCSR3C,
		.r_ubrrl = UBRR3L,
		.r_ubrrh = UBRR3H,
		.rxc = {
			 .enable = AVR_IO_REGBIT(UCSR3B, RXCIE3),
			 .raised = AVR_IO_REGBIT(UCSR3A, RXC3),
			 .vector = USART3_RX_vect,
		},
		.txc = {
			 .enable = AVR_IO_REGBIT(UCSR3B, TXCIE3),
			 .raised = AVR_IO_REGBIT(UCSR3A, TXC3),
			 .vector = USART3_TX_vect,
		},
		.udrc = {
			 .enable = AVR_IO_REGBIT(UCSR3B, UDRIE3),
			 .raised = AVR_IO_REGBIT(UCSR3A, UDRE3),
			 .vector = USART3_UDRE_vect,
		},
	},
	.adc = {
		.r_admux = ADMUX,
		.mux = { AVR_IO_REGBIT(ADMUX, MUX0), AVR_IO_REGBIT(ADMUX, MUX1),
						AVR_IO_REGBIT(ADMUX, MUX2), AVR_IO_REGBIT(ADMUX, MUX3),
						AVR_IO_REGBIT(ADMUX, MUX4),AVR_IO_REGBIT(ADCSRB, MUX5),},
		.ref = { AVR_IO_REGBIT(ADMUX, REFS0), AVR_IO_REGBIT(ADMUX, REFS1)},
		.ref_values = { [1] = ADC_VREF_AVCC, [2] = ADC_VREF_V110, [3] = ADC_VREF_V256 },

		.adlar = AVR_IO_REGBIT(ADMUX, ADLAR),
		.r_adcsra = ADCSRA,
		.aden = AVR_IO_REGBIT(ADCSRA, ADEN),
		.adsc = AVR_IO_REGBIT(ADCSRA, ADSC),
		.adate = AVR_IO_REGBIT(ADCSRA, ADATE),
		.adps = { AVR_IO_REGBIT(ADCSRA, ADPS0), AVR_IO_REGBIT(ADCSRA, ADPS1), AVR_IO_REGBIT(ADCSRA, ADPS2),},

