buserror/simavr/simavr/cores/sim_atmega2560.c
		.r_adch = ADCH,
		.r_adcl = ADCL,

		.r_adcsrb = ADCSRB,
		.adts = { AVR_IO_REGBIT(ADCSRB, ADTS0), AVR_IO_REGBIT(ADCSRB, ADTS1), AVR_IO_REGBIT(ADCSRB, ADTS2),},

		.muxmode = {
			 [0] = AVR_ADC_SINGLE(0), [1] = AVR_ADC_SINGLE(1),
			 [2] = AVR_ADC_SINGLE(2), [3] = AVR_ADC_SINGLE(3),
			 [4] = AVR_ADC_SINGLE(4), [5] = AVR_ADC_SINGLE(5),
			 [6] = AVR_ADC_SINGLE(6), [7] = AVR_ADC_SINGLE(7),

			 [ 8] = AVR_ADC_DIFF(0, 0,  10), [ 9] = AVR_ADC_DIFF(1, 0,  10),
			 [10] = AVR_ADC_DIFF(0, 0, 200), [11] = AVR_ADC_DIFF(1, 0, 200),
			 [12] = AVR_ADC_DIFF(2, 2,  10), [13] = AVR_ADC_DIFF(3, 2,  10),
			 [14] = AVR_ADC_DIFF(2, 2, 200), [15] = AVR_ADC_DIFF(3, 2, 200),

			 [16] = AVR_ADC_DIFF(0, 1,	1), [17] = AVR_ADC_DIFF(1, 1,	1),
			 [18] = AVR_ADC_DIFF(2, 1,	1), [19] = AVR_ADC_DIFF(3, 1,	1),
			 [20] = AVR_ADC_DIFF(4, 1,	1), [21] = AVR_ADC_DIFF(5, 1,	1),
			 [22] = AVR_ADC_DIFF(6, 1,	1), [23] = AVR_ADC_DIFF(7, 1,	1),

			 [24] = AVR_ADC_DIFF(0, 2,	1), [25] = AVR_ADC_DIFF(1, 2,	1),
			 [26] = AVR_ADC_DIFF(2, 2,	1), [27] = AVR_ADC_DIFF(3, 2,	1),
			 [28] = AVR_ADC_DIFF(4, 2,	1), [29] = AVR_ADC_DIFF(5, 2,	1),

			 [30] = AVR_ADC_REF(1100),	// 1.1V
			 [31] = AVR_ADC_REF(0),		// GND

			 [32] = AVR_ADC_SINGLE( 8), [33] = AVR_ADC_SINGLE( 9),
			 [34] = AVR_ADC_SINGLE(10), [35] = AVR_ADC_SINGLE(11),
			 [36] = AVR_ADC_SINGLE(12), [37] = AVR_ADC_SINGLE(13),
			 [38] = AVR_ADC_SINGLE(14), [39] = AVR_ADC_SINGLE(15),

			 [40] = AVR_ADC_DIFF( 8,  8,  10), [41] = AVR_ADC_DIFF( 9,  8,  10),
			 [42] = AVR_ADC_DIFF( 8,  8, 200), [43] = AVR_ADC_DIFF( 9,  8, 200),

			 [44] = AVR_ADC_DIFF(10, 10,  10), [45] = AVR_ADC_DIFF(11, 10,  10),
			 [46] = AVR_ADC_DIFF(10, 10, 200), [47] = AVR_ADC_DIFF(11, 10, 200),

			 [48] = AVR_ADC_DIFF( 8,  9,	1), [49] = AVR_ADC_DIFF( 9,  9,	1),
			 [50] = AVR_ADC_DIFF(10,  9,	1), [51] = AVR_ADC_DIFF(11,  9,	1),
			 [52] = AVR_ADC_DIFF(12,  9,	1), [53] = AVR_ADC_DIFF(13,  9,	1),
			 [54] = AVR_ADC_DIFF(14,  9,	1), [55] = AVR_ADC_DIFF(15,  9,	1),

			 [56] = AVR_ADC_DIFF( 8, 10,	1), [57] = AVR_ADC_DIFF( 9, 10,	1),
			 [58] = AVR_ADC_DIFF(10, 10,	1), [59] = AVR_ADC_DIFF(11, 10,	1),
			 [60] = AVR_ADC_DIFF(12, 10,	1), [61] = AVR_ADC_DIFF(13, 10,	1),
		},

		.adc = {
			 .enable = AVR_IO_REGBIT(ADCSRA, ADIE),
			 .raised = AVR_IO_REGBIT(ADCSRA, ADIF),
			 .vector = ADC_vect,
		},
	},
	.timer0 = {
		.name = '0',
		.wgm = { AVR_IO_REGBIT(TCCR0A, WGM00), AVR_IO_REGBIT(TCCR0A, WGM01), AVR_IO_REGBIT(TCCR0B, WGM02) },
		.wgm_op = {
			 [0] = AVR_TIMER_WGM_NORMAL8(),
			 [2] = AVR_TIMER_WGM_CTC(),
			 [3] = AVR_TIMER_WGM_FASTPWM8(),
			 [7] = AVR_TIMER_WGM_OCPWM(),
		},
		.cs = { AVR_IO_REGBIT(TCCR0B, CS00), AVR_IO_REGBIT(TCCR0B, CS01), AVR_IO_REGBIT(TCCR0B, CS02) },
		.cs_div = { 0, 0, 3 /* 8 */, 6 /* 64 */, 8 /* 256 */, 10 /* 1024 */ },

		.r_tcnt = TCNT0,

		.overflow = {
			 .enable = AVR_IO_REGBIT(TIMSK0, TOIE0),
			 .raised = AVR_IO_REGBIT(TIFR0, TOV0),
			 .vector = TIMER0_OVF_vect,
		},
		.comp = {
			 [AVR_TIMER_COMPA] = {
					.r_ocr = OCR0A,
					.com = AVR_IO_REGBITS(TCCR0A, COM0A0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTB, PB7), // same as timer1C
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK0, OCIE0A),
						.raised = AVR_IO_REGBIT(TIFR0, OCF0A),
						.vector = TIMER0_COMPA_vect,
					},
			 },
			 [AVR_TIMER_COMPB] = {
					.r_ocr = OCR0B,
					.com = AVR_IO_REGBITS(TCCR0A, COM0B0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTG, PG5),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK0, OCIE0B),
						.raised = AVR_IO_REGBIT(TIFR0, OCF0B),
						.vector = TIMER0_COMPB_vect,
					},
			 },
		},
	},
	.timer1 = {
		.name = '1',
		.disabled = AVR_IO_REGBIT(PRR0,PRTIM1),
		.wgm = { AVR_IO_REGBIT(TCCR1A, WGM10), AVR_IO_REGBIT(TCCR1A, WGM11),
						AVR_IO_REGBIT(TCCR1B, WGM12), AVR_IO_REGBIT(TCCR1B, WGM13) },
		.wgm_op = {
			 [0] = AVR_TIMER_WGM_NORMAL16(),
			 // TODO: 1 PWM phase correct 8bit
			 //		 2 PWM phase correct 9bit
			 //		 3 PWM phase correct 10bit
			 [4] = AVR_TIMER_WGM_CTC(),
			 [5] = AVR_TIMER_WGM_FASTPWM8(),
			 [6] = AVR_TIMER_WGM_FASTPWM9(),
			 [7] = AVR_TIMER_WGM_FASTPWM10(),
			 // TODO: 8, 9 PWM phase and freq correct ICR & 10, 11
			 [12] = AVR_TIMER_WGM_ICCTC(),
			 [14] = AVR_TIMER_WGM_ICPWM(),
			 [15] = AVR_TIMER_WGM_OCPWM(),
		},
		.cs = { AVR_IO_REGBIT(TCCR1B, CS10), AVR_IO_REGBIT(TCCR1B, CS11), AVR_IO_REGBIT(TCCR1B, CS12) },
		.cs_div = { 0, 0, 3 /* 8 */, 6 /* 64 */, 8 /* 256 */, 10 /* 1024 */  /* External clock T1 is not handled */},

		.r_tcnt = TCNT1L,
		.r_tcnth = TCNT1H,
		.r_icr = ICR1L,
		.r_icrh = ICR1H,

		.ices = AVR_IO_REGBIT(TCCR1B, ICES1),
		.icp = AVR_IO_REGBIT(PORTD, PD4),

		.overflow = {
			 .enable = AVR_IO_REGBIT(TIMSK1, TOIE1),
			 .raised = AVR_IO_REGBIT(TIFR1, TOV1),
			 .vector = TIMER1_OVF_vect,
		},
		.icr = {
			 .enable = AVR_IO_REGBIT(TIMSK1, ICIE1),
			 .raised = AVR_IO_REGBIT(TIFR1, ICF1),
			 .vector = TIMER1_CAPT_vect,
		},
		.comp = {
			 [AVR_TIMER_COMPA] = {
					.r_ocr = OCR1AL,
					.r_ocrh = OCR1AH,	// 16 bits timers have two bytes of it
					.com = AVR_IO_REGBITS(TCCR1A, COM1A0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTB, PB5),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK1, OCIE1A),
						.raised = AVR_IO_REGBIT(TIFR1, OCF1A),
						.vector = TIMER1_COMPA_vect,
					},
			 },
			 [AVR_TIMER_COMPB] = {
					.r_ocr = OCR1BL,
					.r_ocrh = OCR1BH,
					.com = AVR_IO_REGBITS(TCCR1A, COM1B0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTB, PB6),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK1, OCIE1B),
						.raised = AVR_IO_REGBIT(TIFR1, OCF1B),
						.vector = TIMER1_COMPB_vect,
					},
			 },
			 [AVR_TIMER_COMPC] = {
					.r_ocr = OCR1CL,
					.r_ocrh = OCR1CH,
					.com = AVR_IO_REGBITS(TCCR1A, COM1C0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTB, PB7), // same as timer0A
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK1, OCIE1C),
						.raised = AVR_IO_REGBIT(TIFR1, OCF1C),
						.vector = TIMER1_COMPC_vect,
					},
			 },
		},

	},
	.timer2 = {
		.name = '2',
		.wgm = { AVR_IO_REGBIT(TCCR2A, WGM20), AVR_IO_REGBIT(TCCR2A, WGM21), AVR_IO_REGBIT(TCCR2B, WGM22) },
		.wgm_op = {
			 [0] = AVR_TIMER_WGM_NORMAL8(),
			 // TODO 1 pwm phase correct 
			 [2] = AVR_TIMER_WGM_CTC(),
			 [3] = AVR_TIMER_WGM_FASTPWM8(),
			 [7] = AVR_TIMER_WGM_OCPWM(),
		},
		.cs = { AVR_IO_REGBIT(TCCR2B, CS20), AVR_IO_REGBIT(TCCR2B, CS21), AVR_IO_REGBIT(TCCR2B, CS22) },
		.cs_div = { 0, 0, 3 /* 8 */, 5 /* 32 */, 6 /* 64 */, 7 /* 128 */, 8 /* 256 */, 10 /* 1024 */ },

