buserror/simavr/simavr/cores/sim_atmega2560.c
		.r_tcnt = TCNT2,
		// asynchronous timer source bit.. if set, use 32khz frequency
		.as2 = AVR_IO_REGBIT(ASSR, AS2),
		
		.overflow = {
			 .enable = AVR_IO_REGBIT(TIMSK2, TOIE2),
			 .raised = AVR_IO_REGBIT(TIFR2, TOV2),
			 .vector = TIMER2_OVF_vect,
		},
		.comp = {
			 [AVR_TIMER_COMPA] = {
					.r_ocr = OCR2A,
					.com = AVR_IO_REGBITS(TCCR2A, COM2A0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTB, PB4),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK2, OCIE2A),
						.raised = AVR_IO_REGBIT(TIFR2, OCF2A),
						.vector = TIMER2_COMPA_vect,
					},
			 },
				// TIMER2_COMPB is only appeared in 2560
			 //[AVR_TIMER_COMPB] = {
			 //	.r_ocr = OCR2B,
			 //	.com = AVR_IO_REGBITS(TCCR2A, COM2B0, 0x3),
			 //	.com_pin = AVR_IO_REGBIT(PORTH, PH6),
			 //	.interrupt = {
			 //		.enable = AVR_IO_REGBIT(TIMSK2, OCIE2B),
			 //		.raised = AVR_IO_REGBIT(TIFR2, OCF2B),
			 //		.vector = TIMER2_COMPB_vect,
			 //	},
			 //},
		},
	},
	.timer3 = {
		.name = '3',
		.wgm = { AVR_IO_REGBIT(TCCR3A, WGM30), AVR_IO_REGBIT(TCCR3A, WGM31),
						AVR_IO_REGBIT(TCCR3B, WGM32), AVR_IO_REGBIT(TCCR3B, WGM33) },
		.wgm_op = {
			 [0] = AVR_TIMER_WGM_NORMAL16(),
			 // TODO: 1 PWM phase correct 8bit
			 //		 2 PWM phase correct 9bit
			 //		 3 PWM phase correct 10bit
			 [4] = AVR_TIMER_WGM_CTC(),
			 [5] = AVR_TIMER_WGM_FASTPWM8(),
			 [6] = AVR_TIMER_WGM_FASTPWM9(),
			 [7] = AVR_TIMER_WGM_FASTPWM10(),
			 // TODO: 8 PWM phase and freq correct ICR
			 //		 9 PWM phase and freq correct OCR
			 //		 10
			 //		 11
			 [12] = AVR_TIMER_WGM_ICCTC(),
			 [14] = AVR_TIMER_WGM_ICPWM(),
			 [15] = AVR_TIMER_WGM_OCPWM(),
		},
		.cs = { AVR_IO_REGBIT(TCCR3B, CS30), AVR_IO_REGBIT(TCCR3B, CS31), AVR_IO_REGBIT(TCCR3B, CS32) },
		.cs_div = { 0, 0, 3 /* 8 */, 6 /* 64 */, 8 /* 256 */, 10 /* 1024 */  /* TODO: 2 External clocks */},

		.r_tcnt = TCNT3L,
		.r_icr = ICR3L,
		.r_icrh = ICR3H,
		.r_tcnth = TCNT3H,

		.ices = AVR_IO_REGBIT(TCCR3B, ICES3),
		.icp = AVR_IO_REGBIT(PORTE, PE7),

		.overflow = {
			 .enable = AVR_IO_REGBIT(TIMSK3, TOIE3),
			 .raised = AVR_IO_REGBIT(TIFR3, TOV3),
			 .vector = TIMER3_OVF_vect,
		},
		.comp = {
			 [AVR_TIMER_COMPA] = {
					.r_ocr = OCR3AL,
					.r_ocrh = OCR3AH,	// 16 bits timers have two bytes of it
					.com = AVR_IO_REGBITS(TCCR3A, COM3A0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTE, PE3),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK3, OCIE3A),
						.raised = AVR_IO_REGBIT(TIFR3, OCF3A),
						.vector = TIMER3_COMPA_vect,
					}
			 },
			 [AVR_TIMER_COMPB] = {
					.r_ocr = OCR3BL,
					.r_ocrh = OCR3BH,
					.com = AVR_IO_REGBITS(TCCR3A, COM3B0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTE, PE4),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK3, OCIE3B),
						.raised = AVR_IO_REGBIT(TIFR3, OCF3B),
						.vector = TIMER3_COMPB_vect,
					}
			 },
			 [AVR_TIMER_COMPC] = {
					.r_ocr = OCR3CL,
					.r_ocrh = OCR3CH,
					.com = AVR_IO_REGBITS(TCCR3A, COM3C0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTE, PE5),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK3, OCIE3C),
						.raised = AVR_IO_REGBIT(TIFR3, OCF3C),
						.vector = TIMER3_COMPC_vect,
					}
			 }
		},
		.icr = {
			 .enable = AVR_IO_REGBIT(TIMSK3, ICIE3),
			 .raised = AVR_IO_REGBIT(TIFR3, ICF3),
			 .vector = TIMER3_CAPT_vect,
		},
	},
	.timer4 = {
		.name = '4',
		.disabled = AVR_IO_REGBIT(PRR1,PRTIM4),
		.wgm = { AVR_IO_REGBIT(TCCR4A, WGM40), AVR_IO_REGBIT(TCCR4A, WGM41),
						AVR_IO_REGBIT(TCCR4B, WGM42), AVR_IO_REGBIT(TCCR4B, WGM43) },
		.wgm_op = {
			 [0] = AVR_TIMER_WGM_NORMAL16(),
			 // TODO: 1 PWM phase correct 8bit
			 //		 2 PWM phase correct 9bit
			 //		 3 PWM phase correct 10bit
			 [4] = AVR_TIMER_WGM_CTC(),
			 [5] = AVR_TIMER_WGM_FASTPWM8(),
			 [6] = AVR_TIMER_WGM_FASTPWM9(),
			 [7] = AVR_TIMER_WGM_FASTPWM10(),
			 // TODO: 8, 9 PWM phase and freq correct ICR & 10, 11
			 [12] = AVR_TIMER_WGM_ICCTC(),
			 [14] = AVR_TIMER_WGM_ICPWM(),
			 [15] = AVR_TIMER_WGM_OCPWM(),
		},
		.cs = { AVR_IO_REGBIT(TCCR4B, CS40), AVR_IO_REGBIT(TCCR4B, CS41), AVR_IO_REGBIT(TCCR4B, CS42) },
		.cs_div = { 0, 0, 3 /* 8 */, 6 /* 64 */, 8 /* 256 */, 10 /* 1024 */  /* External clock T1 is not handled */},

		.r_tcnt = TCNT4L,
		.r_tcnth = TCNT4H,
		.r_icr = ICR4L,
		.r_icrh = ICR4H,

		.ices = AVR_IO_REGBIT(TCCR4B, ICES4),
		.icp = AVR_IO_REGBIT(PORTL, PL0),

		.overflow = {
			 .enable = AVR_IO_REGBIT(TIMSK4, TOIE4),
			 .raised = AVR_IO_REGBIT(TIFR4, TOV4),
			 .vector = TIMER4_OVF_vect,
		},
		.icr = {
			 .enable = AVR_IO_REGBIT(TIMSK4, ICIE4),
			 .raised = AVR_IO_REGBIT(TIFR4, ICF4),
			 .vector = TIMER4_CAPT_vect,
		},
		.comp = {
			 [AVR_TIMER_COMPA] = {
					.r_ocr = OCR4AL,
					.r_ocrh = OCR4AH,	// 16 bits timers have two bytes of it
					.com = AVR_IO_REGBITS(TCCR4A, COM4A0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTH, PH3),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK4, OCIE4A),
						.raised = AVR_IO_REGBIT(TIFR4, OCF4A),
						.vector = TIMER4_COMPA_vect,
					},
			 },
			 [AVR_TIMER_COMPB] = {
					.r_ocr = OCR4BL,
					.r_ocrh = OCR4BH,
					.com = AVR_IO_REGBITS(TCCR4A, COM4B0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTH, PH4),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK4, OCIE4B),
						.raised = AVR_IO_REGBIT(TIFR4, OCF4B),
						.vector = TIMER4_COMPB_vect,
					},
			 },
			 [AVR_TIMER_COMPC] = {
					.r_ocr = OCR4CL,
					.r_ocrh = OCR4CH,
					.com = AVR_IO_REGBITS(TCCR4A, COM4C0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTH, PH5),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK4, OCIE4C),
						.raised = AVR_IO_REGBIT(TIFR4, OCF4C),
						.vector = TIMER4_COMPC_vect,
					},
			 },
		},

	},
	.timer5 = {
		.name = '5',
		.disabled = AVR_IO_REGBIT(PRR1,PRTIM5),
		.wgm = { AVR_IO_REGBIT(TCCR5A, WGM50), AVR_IO_REGBIT(TCCR5A, WGM51),
						AVR_IO_REGBIT(TCCR5B, WGM52), AVR_IO_REGBIT(TCCR5B, WGM53) },
		.wgm_op = {
			 [0] = AVR_TIMER_WGM_NORMAL16(),
			 // TODO: 1 PWM phase correct 8bit
			 //		 2 PWM phase correct 9bit
			 //		 3 PWM phase correct 10bit
			 [4] = AVR_TIMER_WGM_CTC(),
			 [5] = AVR_TIMER_WGM_FASTPWM8(),
			 [6] = AVR_TIMER_WGM_FASTPWM9(),
			 [7] = AVR_TIMER_WGM_FASTPWM10(),
			 // TODO: 8, 9 PWM phase and freq correct ICR & 10, 11
			 [12] = AVR_TIMER_WGM_ICCTC(),
			 [14] = AVR_TIMER_WGM_ICPWM(),
			 [15] = AVR_TIMER_WGM_OCPWM(),
		},
		.cs = { AVR_IO_REGBIT(TCCR5B, CS50), AVR_IO_REGBIT(TCCR5B, CS51), AVR_IO_REGBIT(TCCR5B, CS52) },
		.cs_div = { 0, 0, 3 /* 8 */, 6 /* 64 */, 8 /* 256 */, 10 /* 1024 */  /* External clock T1 is not handled */},

