buserror/simavr/simavr/cores/sim_atmega2560.c
		.r_tcnt = TCNT5L,
		.r_tcnth = TCNT5H,
		.r_icr = ICR5L,
		.r_icrh = ICR5H,

		.ices = AVR_IO_REGBIT(TCCR5B, ICES5),
		.icp = AVR_IO_REGBIT(PORTL, PL1),

		.overflow = {
			 .enable = AVR_IO_REGBIT(TIMSK5, TOIE5),
			 .raised = AVR_IO_REGBIT(TIFR5, TOV5),
			 .vector = TIMER5_OVF_vect,
		},
		.icr = {
			 .enable = AVR_IO_REGBIT(TIMSK5, ICIE5),
			 .raised = AVR_IO_REGBIT(TIFR5, ICF5),
			 .vector = TIMER5_CAPT_vect,
		},
		.comp = {
			 [AVR_TIMER_COMPA] = {
					.r_ocr = OCR5AL,
					.r_ocrh = OCR5AH,	// 16 bits timers have two bytes of it
					.com = AVR_IO_REGBITS(TCCR5A, COM5A0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTL, PL3),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK5, OCIE5A),
						.raised = AVR_IO_REGBIT(TIFR5, OCF5A),
						.vector = TIMER5_COMPA_vect,
					},
			 },
			 [AVR_TIMER_COMPB] = {
					.r_ocr = OCR5BL,
					.r_ocrh = OCR5BH,
					.com = AVR_IO_REGBITS(TCCR5A, COM5B0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTL, PL4),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK5, OCIE5B),
						.raised = AVR_IO_REGBIT(TIFR5, OCF5B),
						.vector = TIMER5_COMPB_vect,
					},
			 },
			 [AVR_TIMER_COMPC] = {
					.r_ocr = OCR5CL,
					.r_ocrh = OCR5CH,
					.com = AVR_IO_REGBITS(TCCR5A, COM5C0, 0x3),
					.com_pin = AVR_IO_REGBIT(PORTL, PL5),
					.interrupt = {
						.enable = AVR_IO_REGBIT(TIMSK5, OCIE5C),
						.raised = AVR_IO_REGBIT(TIFR5, OCF5C),
						.vector = TIMER5_COMPC_vect,
					},
			 },
		},

	},
	.spi = {
		.disabled = AVR_IO_REGBIT(PRR0,PRSPI),

		.r_spdr = SPDR,
		.r_spcr = SPCR,
		.r_spsr = SPSR,

		.spe = AVR_IO_REGBIT(SPCR, SPE),
		.mstr = AVR_IO_REGBIT(SPCR, MSTR),

		.spr = { AVR_IO_REGBIT(SPCR, SPR0), AVR_IO_REGBIT(SPCR, SPR1), AVR_IO_REGBIT(SPSR, SPI2X) },
		.spi = {
			 .enable = AVR_IO_REGBIT(SPCR, SPIE),
			 .raised = AVR_IO_REGBIT(SPSR, SPIF),
			 .vector = SPI_STC_vect,
		},
	},

	.twi = {

		.r_twcr = TWCR,
		.r_twsr = TWSR,
		.r_twbr = TWBR,
		.r_twdr = TWDR,
		.r_twar = TWAR,
		.r_twamr = TWAMR,

		.twen = AVR_IO_REGBIT(TWCR, TWEN),
		.twea = AVR_IO_REGBIT(TWCR, TWEA),
		.twsta = AVR_IO_REGBIT(TWCR, TWSTA),
		.twsto = AVR_IO_REGBIT(TWCR, TWSTO),
		.twwc = AVR_IO_REGBIT(TWCR, TWWC),

		.twsr = AVR_IO_REGBITS(TWSR, TWS3, 0x1f),	// 5 bits
		.twps = AVR_IO_REGBITS(TWSR, TWPS0, 0x3),	// 2 bits

		.twi = {
			 .enable = AVR_IO_REGBIT(TWCR, TWIE),
			 .raised = AVR_IO_REGBIT(TWCR, TWINT),
			 .raise_sticky = 1,
			 .vector = TWI_vect,
		},
	},
};

static avr_t * make()
{
	return avr_core_allocate(&mcu_mega2560.core, sizeof(struct mcu_t));
}

avr_kind_t mega2560 = {
		 .names = { "atmega2560" },
		 .make = make
};

void m2560_init(struct avr_t * avr)
{
	struct mcu_t * mcu = (struct mcu_t*)avr;
	
	avr_eeprom_init(avr, &mcu->eeprom);
	avr_flash_init(avr, &mcu->selfprog);
	avr_extint_init(avr, &mcu->extint);
	avr_watchdog_init(avr, &mcu->watchdog);
	avr_ioport_init(avr, &mcu->porta);
	avr_ioport_init(avr, &mcu->portb);
	avr_ioport_init(avr, &mcu->portc);
	avr_ioport_init(avr, &mcu->portd);
	avr_ioport_init(avr, &mcu->porte);
	avr_ioport_init(avr, &mcu->portf);
	avr_ioport_init(avr, &mcu->portg);
	avr_ioport_init(avr, &mcu->porth);
	avr_ioport_init(avr, &mcu->portj);
	avr_ioport_init(avr, &mcu->portk);
	avr_ioport_init(avr, &mcu->portl);

	avr_uart_init(avr, &mcu->uart0);
	avr_uart_init(avr, &mcu->uart1);
	avr_uart_init(avr, &mcu->uart2);
	avr_uart_init(avr, &mcu->uart3);
	avr_adc_init(avr, &mcu->adc);
	avr_timer_init(avr, &mcu->timer0);
	avr_timer_init(avr, &mcu->timer1);
	avr_timer_init(avr, &mcu->timer2);
	avr_timer_init(avr, &mcu->timer3);
	avr_timer_init(avr, &mcu->timer4);
	avr_timer_init(avr, &mcu->timer5);
	avr_spi_init(avr, &mcu->spi);
	avr_twi_init(avr, &mcu->twi);
}

void m2560_reset(struct avr_t * avr)
{
// struct mcu_t * mcu = (struct mcu_t*)avr;
}


